views/exam/_form.php

SELECT "course".* FROM "course" LEFT JOIN "handles" ON id::integer=course::integer WHERE "handles"."staff"=1
---
    ]);?>

    <?php } else { ?>
        <?= $form->field($model, 'course')->widget(\kartik\select2\Select2::className(), [
            'data' => (ArrayHelper::map(Course::find()->leftjoin('handles', 'id::integer=course::integer')
                ->where(['handles.staff' => Yii::$app->user->identity->getId()])->all(), 'id', 'title')),
            'language' => 'it',
            'options' => ['placeholder' => 'Select a Course ...'],
            'pluginOptions' => [
                'allowClear' => true
            ],
        ]);