controllers/CourseController.php

    public function actionIndex($id)
    {
        $edition = CourseSite::findCurrentCourseSite($id);
        // check if user is subscribed to that course site
        $subscribed = false;
        $register = Registers::find()->where(['student' => Yii::$app->user->id])->one();
        if($register)
            $subscribed = true;
        return $this->render('index', [
            'model' => $this->findModel($id),
            'edition' => $edition,
            'pages' => $edition->getPages()->all(),
---
SELECT * FROM "registers" WHERE "student"=1
SELECT * FROM "page" WHERE "course_site"=1

    protected function findModel($id)
    {
        if (($model = Course::findOne($id)) !== null) {
---
SELECT * FROM "course" WHERE "id"='1'