controllers/ExamController.php

SELECT * FROM "exam" WHERE "id"='2'
---
    protected function findModel($id)
    {
        if(($model = Exam::findOne($id)) !== null) {