controllers/SiteController.php

INSERT INTO "usertemp" ("username", "timestamp") VALUES ('silvana.castano@asdunimi.it', 1619873912)
---
    public function actionLogin()
    {
        // a logged user trying to access to the login page will be rendered to the home
        if(!Yii::$app->user->isGuest) {
            return $this->goHome();
        }

        // someone is submitting login data
        $model = new LoginForm();
        if($model->load(Yii::$app->request->post())) {
			switch($model->login()) {
				case 0:
					$model->password = '';
					return $this->render('login', [
						'model' => $model,
						]);
					break;
				case 1:
				    // this will render a landing page depending on the role
					return $this->roleBasedHomePage();
					break;
				case 100:
				    // store username and password of the login form in the temporary table
					$temp = new Usertemp();
					$temp->setUsername($model->username);
					$temp->save();

SELECT * FROM "student" WHERE "id"=5
SELECT * FROM "course_site"
SELECT * FROM "registers" WHERE "student"=5
SELECT * FROM "course_site" WHERE "id"=3
SELECT * FROM "exam" WHERE "id" IN (1, 2)
SELECT * FROM "request" WHERE "student"=5
SELECT * FROM "thesis" WHERE "id"=1
---
	public function actionStudenthome()
    {
        $model = new Registers();
        // someone is trying to register at a course
        if($course = Yii::$app->request->post('submit')) {
            $model->student = \Yii::$app->user->identity->id;
            $model->course_site = $course;
            // set the current data
            $model->date = date('Y-m-d H:i:s');
            // insert data in the db only if allowed
            if($model->courseSite->opening_date <= $model->date & $model->date <= $model->courseSite->closing_date) {
                $model->save();
                \Yii::$app->getSession()->setFlash('success', 'Ti sei iscritto al corso!');
            }
            else
                \Yii::$app->getSession()->setFlash('warning', 'Iscrizione fuori periodo');

            return $this->redirect(['studenthome']);
        }

        $student = Student::findOne(\Yii::$app->user->identity->id);
        $allcourses = CourseSite::find()->all();

		return $this->render('studenthome', [
		    'student' => $student,
            'courses' => $student->getCourseSites()->all(),
            'allcourses' => $allcourses,
            'model' => $model,
            'exams' => $student->getExams()->all(),
            'my_thesis' => $student->getRequestedThesis()->all()
        ]);