widgets/MainMenu.php

SELECT * FROM "course"
---
    protected function getCoursesItems() {
        $items = [];
        foreach(Course::find()->all() as $course) {