models/CourseSite.php

    public static function findCurrentCourseSite($course)
    {
        return static::findOne(['course' => $course, 'is_current' => true]);
---
SELECT * FROM "course_site" WHERE ("course"='1') AND ("is_current"=TRUE)