models/Handles.php

SELECT * FROM "handles" WHERE ("staff"=1) AND ("course"=2)
---
    public function checkHandles($staff,$course)
    {
        if(($model = Handles::findOne(['staff' => $staff , 'course'=> $course])) !== null) {