models/Usertemp.php

	public static function findByUsername($username)
    {
		//$current = current time();
		$config = require __DIR__ . '/../config/web.php';
		$current = Yii::$app->formatter->asTimestamp(date('Y-d-m h:i:s'));
		$current = $current - $config['params']['time_validity'];
		return Usertemp::find()->where(['username'=>$username])
               ->andWhere(['>', 'timestamp', $current])->all();
---
SELECT * FROM "usertemp" WHERE ("username"='silvana.castano@unisdasdasmi.it') AND ("timestamp" > 1619873272)